using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Labor_rabota__3
{
    class Program
    {
        static void Main(string[] args)
        {
            // Лабораторная работа №3 (Проектирование типов. Классы.)
/*
            Задание
1)	Определить класс, указанный в варианте, содержащий:
•	Не менее трех конструкторов(с параметрами  и без, а также с параметрами по умолчанию);
•	статический конструктор(конструктор типа);
•	определите закрытый конструктор; предложите варианты его вызова;
•	поле - только для чтения(например, для каждого экземпляра сделайте поле только для чтения ID -равно некоторому уникальному номеру(хэшу) вычисляемому автоматически на основе инициализаторов объекта);
•	поле - константу;
•	свойства(get, set) – для всех поле класса(поля класса должны быть закрытыми); Для одного из свойств ограните доступ по set
•	в одном из методов класса для работы с аргументами используйте ref -и out-параметры.
•	создайте в классе статическое поле, хранящее количество созданных объектов(инкрементируется в конструкторе) и статический метод вывода информации о классе.
•	сделайте касс partial
•	переопределяете методы класса Object: Equals, для сравнения объектов,  GetHashCode; для алгоритма вычисления хэша руководствуйтесь стандартными рекомендациями, ToString – вывода строки –информации об объекте.
2)	Создайте несколько объектов вашего типа.Выполните вызов конструкторов, свойств, методов, сравнение объекты, проверьте тип созданного объекта и т.п.
3)	Создайте массив объектов вашего типа.И выполните задание, выделенное курсивом в таблице.
4)	Создайте и выведите анонимный тип(по образцу вашего класса).
*/


        }
    }
}
